/**
 * Created by Admin on 29.09.2016.
 */

angular.module('app').filter('ruFormat2', function() {
    return function(x) {
        return d3.format(",.1f")(x);
    };
});


angular.module('app').controller('CubeInSpheteCtrl', function ($scope, $mdDialog) {

    var locale = {
        "decimal": ",",
        "thousands": "\u00A0",
        "grouping": [3],
        "currency": ["", " тнг."],
        "dateTime": "%A, %e %B %Y г. %X",
        "date": "%d.%m.%Y",
        "time": "%H:%M:%S",
        "periods": ["AM", "PM"],
        "days": ["воскресенье", "понедельник", "вторник", "среда", "четверг", "пятница", "суббота"],
        "shortDays": ["вс", "пн", "вт", "ср", "чт", "пт", "сб"],
        "months": ["января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа", "сентября", "октября", "ноября", "декабря"],
        "shortMonths": ["янв", "фев", "мар", "апр", "май", "июн", "июл", "авг", "сен", "окт", "ноя", "дек"]
    };



    d3.formatDefaultLocale(locale);






    $scope.menuItems = ['2016', "2017"];

    $scope.data = {

        "2016": [


            {prg: 80, name: "Всего по направлениям", value: 229949718.0},
            {prg: 60, name: "Трансферты", value: 74142316.0},
            {prg: 40, name: "Образование", value: 50590259.8},
            {prg: 30, name: "Здравоохранение", value: 21258147.2},
            {prg: 25, name: "Жилищно-коммунальное хозяйство", value: 20952369.0},
            {prg: 25, name: "Транспорт и коммуникации", value: 16369121.0},
            {prg: 25, name: "Культура, спорт, туризм и информационное пространство", value: 12338726.7},
            {prg: 25, name: "Общественный порядок, безопасность, правовая, судебная, уголовно-исполнительная деятельность", value: 7157398.0},
            {prg: 25, name: "Государственные услуги общего характера", value: 6750488.6},
            {prg: 25, name: "Социальная помощь и социальное обеспечение", value: 6535987.0},
            {prg: 25, name: "Сельское, водное, лесное, рыбное хозяйство, особо охраняемые природные территории, охрана окружающей среды и животного мира, земельные отношения", value: 4618270.0},
            {prg: 25, name: "Промышленность, архитектурная, градостроительная и строительная деятельность", value: 4250397.9},
            {prg: 25, name: "Прочие", value: 3924672.8},
            {prg: 20, name: "Оборона", value: 494499.0},
            {prg: 20, name: "Топливно-энергетический комплекс и недропользование", value: 497901.0},
            {prg: 20, name: "Обслуживание долга", value: 69164.0}


        ],


        "2017": [

            {prg: 80, name: "Всего по направлениям", value: 311163178.2},
            {prg: 60, name: "Трансферты", value: 94694807.0},
            {prg: 40, name: "Образование", value: 59598570.0},
            {prg: 30, name: "Здравоохранение", value: 40985808.0},
            {prg: 25, name: "Жилищно-коммунальное хозяйство", value: 39826257.0},
            {prg: 25, name: "Транспорт и коммуникации", value: 17814472.1},
            {prg: 25, name: "Культура, спорт, туризм и информационное пространство", value: 14867646.0},
            {prg: 25, name: "Общественный порядок, безопасность, правовая, судебная, уголовно-исполнительная деятельность", value: 11312936.0},
            {prg: 25, name: "Государственные услуги общего характера", value: 10203559.1},
            {prg: 25, name: "Социальная помощь и социальное обеспечение", value: 6304325.0},
            {prg: 25, name: "Сельское, водное, лесное, рыбное хозяйство, особо охраняемые природные территории, охрана окружающей среды и животного мира, земельные отношения", value: 6151318.2},
            {prg: 25, name: "Промышленность, архитектурная, градостроительная и строительная деятельность", value: 5326778.7},
            {prg: 25, name: "Прочие", value: 1502190.0},
            {prg: 20, name: "Оборона", value: 1308265.0},
            {prg: 20, name: "Топливно-энергетический комплекс и недропользование", value: 1203978.1},
            {prg: 20, name: "Обслуживание долга", value: 62268.0}

        ]




    };


    $scope.activeMenu = $scope.menuItems[0];


    $scope.dataTable = $scope.data["2016"];











$scope.selectDate = function (date) {
    $scope.activeMenu = date;


    $scope.dataTable = $scope.data[date];









}




});

